documentacao_oficial.md
```mermaid
classDiagram
    %% Agrupamento Autenticação e Perfis (Herança)
    class Pessoa {
        <<abstract>>
        -String nome
        -String email
        -String idKeycloak
    }

    class PessoaFisica {
        <<abstract>>
        -String cpf
        -String rg
    }

    class PessoaJuridica {
        <<abstract>>
        -String cnpj
        -String inscricaoEstadual
    }

    class Fornecedor {
        -String razaoSocial
    }

    class Cliente {
        -LocalDate dataCadastro
    }

    class Funcionario {
        -String cargo
        -LocalDate dataAdmissao
    }

    class Departamento {
        -String sigla
        -String descricao
    }

    %% Relacionamentos de Pessoas
    Pessoa <|-- PessoaFisica
    Pessoa <|-- PessoaJuridica
    PessoaFisica <|-- Cliente
    PessoaFisica <|-- Funcionario
    PessoaJuridica <|-- Fornecedor
    Departamento "1" <-- "n" Funcionario : trabalha_em

    %% Agrupamento Vitrine
    class Marca {
        -String nome
    }

    class Modelo {
        -String numeracao
    }

    class Fonte {
        -String nome
        -Double preco
        -Integer potencia
        -Integer estoque
        -Certificacao certificacao
    }

    %% Relacionamentos Produto
    Marca "1" <-- "n" Modelo : associado_a
    Modelo "1" <-- "n" Fonte : construida_por
    Fornecedor "n" <-- "n" Fonte : fornecida_por

    %% Carrinho e Transacionais
    class Pedido {
        -LocalDateTime dataHora
        -Double valorTotal
        -Enum StatusPedido
    }

    class ItemPedido {
        -Integer quantidade
        -Double precoUnitario
        -Double subTotal
    }

    %% Composições e Associações de compra
    Cliente "1" <-- "n" Pedido : realiza
    Pedido "1" *-- "n" ItemPedido : composto_por
    ItemPedido "n" <-- "1" Fonte : referenciam
```
